In [28]:
import pandas as pd
import numpy as np

In [29]:
dataframe = pd.read_csv('data.csv', header=0)

In [30]:
dataframe.head()

   Unnamed: 0     Date  Demand
0          96  1964-01   106.1
1          97  1964-02   102.1
2          98  1964-03   105.2
3          99  1964-04   101.0
4         100  1964-05    84.3

In [31]:
dataframe.columns

Index(['Unnamed: 0', 'Date', 'Demand'], dtype='object')

In [32]:
dataframe.drop('Unnamed: 0',
  axis='columns', inplace=True)

In [33]:
dataframe

        Date  Demand
0    1964-01   106.1
1    1964-02   102.1
2    1964-03   105.2
3    1964-04   101.0
4    1964-05    84.3
..       ...     ...
116  1973-09   129.4
117  1973-10   174.1
118  1973-11   197.0
119  1973-12   193.9
120  1974-01   164.1

[121 rows x 2 columns]

In [34]:
dataframe.shape

(121, 2)

In [35]:
dataframe['Date'].dtype

dtype('O')

In [36]:
dataframe["Date"]= pd.to_datetime(dataframe["Date"])

In [37]:
dataframe['Date'].dtype

dtype('<M8[ns]')

In [38]:
dataframe.describe()

           Demand
count  121.000000
mean   125.844628
std     23.407392
min     84.300000
25%    107.100000
50%    123.700000
75%    138.400000
max    197.000000

In [39]:
dataframe['year'] = dataframe['Date'].dt.year

In [40]:
dataframe['month'] = dataframe['Date'].dt.month

In [41]:
dataframe.head(5)

        Date  Demand  year  month
0 1964-01-01   106.1  1964      1
1 1964-02-01   102.1  1964      2
2 1964-03-01   105.2  1964      3
3 1964-04-01   101.0  1964      4
4 1964-05-01    84.3  1964      5